In this notebook, you'll see how to connect to a Postgres database using the sqlalchemy library.

For this notebook, you'll need both the `sqlalchemy` and `psycopg2` libraries installed.

In [1]:
from sqlalchemy import create_engine

First, we need to create a connection string. The format is

 ```<dialect(+driver)>://<username>:<password>@<hostname>:<port>/<database>```

To connect to the Lahman baseball database, you can use the following connection string.

In [2]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

Now, we need to create an engine and use it to connect.

In [62]:
engine = create_engine(connection_string, pool_size=10, max_overflow=20)

Now, we can create our query and pass it into the `.query()` method.

In [4]:
# Look at difference in run time for this:
query = '''
SELECT latitude, longitude
FROM scooters;
'''

result = engine.execute(query)

In [5]:
# Vs this:
query = '''
SELECT COUNT(latitude)
FROM scooters;
'''

result = engine.execute(query)

You can then fetch the results as tuples using either `fetchone` or `fetchall`:

In [6]:
result.fetchone()

(73414043,)

On the other hand, sqlalchemy plays nicely with pandas.

In [7]:
import pandas as pd

In [8]:
lat = pd.read_sql(query, con = engine)
lat.head()

      count
0  73414043

For much more information about SQLAlchemy and to see a more “Pythonic” way to execute queries, see Introduction to Databases in Python: https://www.datacamp.com/courses/introduction-to-relational-databases-in-python

#EDA
As you know, it's important to gain an understanding of new datasets before diving headlong into analysis. Here are some suggestions for guiding the process of getting to know the data contained in these tables:
- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [9]:
#1 EDA - - Are there any null values in any columns in either table?

query1_eda = '''
SELECT count(pubdatetime) as pubdate, count(latitude) as lat, count(longitude) as lon, 
    count(sumdid) as id, count(sumdtype) as type, count(chargelevel) as charge, 
    count(sumdgroup) as group, count(costpermin) as cost, count(companyname) as cmpny
FROM scooters;
'''

result1 = engine.execute(query1_eda)

In [10]:
scooter_count = pd.read_sql(query1_eda, con = engine)
print(scooter_count)

    pubdate       lat       lon        id      type    charge     group
0  73414043  73414043  73414043  73414043  73414043  73413273  73414043  \

       cost     cmpny
0  73414043  73414043

In [11]:
query1a_eda = '''
SELECT count(pubtimestamp) as pubstmp, count(companyname) as cmpny, count(triprecordnum) as triprcd, 
    count(sumdid) as id, count(tripduration) as tripdur, count(tripdistance) as tripdis, 
    count(startdate) as stdt, count(starttime) as sttm, count(enddate) as eddt,
    count(endtime) as edtm, count(startlatitude) as st_lat, count(startlongitude) as st_lon,
    count(endlatitude) as ed_lat, count(endlongitude) as ed_lon, count(triproute) as trp_rt,
    count(create_dt) as crt_dt
FROM trips; 
'''

result1a = engine.execute(query1a_eda)

In [12]:
trip_count = pd.read_sql(query1a_eda, con = engine)
print(trip_count)

   pubstmp   cmpny  triprcd      id  tripdur  tripdis    stdt    sttm    eddt
0   565522  565522   565522  565522   565522   565522  565522  565522  565522  \

     edtm  st_lat  st_lon  ed_lat  ed_lon  trp_rt  crt_dt
0  565522  565522  565522  565522  565522  565522  565522

In [13]:
print(result1a)

<sqlalchemy.engine.cursor.LegacyCursorResult object at 0x0000021344F01C30>

#1 EDA Answer: null values are present in the "chargelevel" column from scooter table

In [14]:
#2 EDA - - What date range is represented in each of the date columns? Investigate any values that seem odd.

query2_eda=  '''
SELECT min(pubdatetime) as min_sctr_dt, max(pubdatetime) as max_sctr_dt
FROM scooters;
'''

result2 = engine.execute(query2_eda)

In [15]:
date_rvw1 = pd.read_sql(query2_eda, con = engine)
print(date_rvw1)

              min_sctr_dt         max_sctr_dt
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [16]:
query2a_eda=  '''
SELECT min(pubtimestamp) as min_trip_dt, max(pubtimestamp) as max_trip_dt,
    min(startdate) as min_st_dt, max(startdate) as max_st_dt, 
    min(starttime) as min_strt, max(starttime) as max_strt,
    min(enddate) as min_end_dt, max(enddate) as max_end_dt,
    min(endtime) as min_end_tm, max(endtime) as max_end_tm
FROM trips;
'''

result2a = engine.execute(query2a_eda)

In [17]:
date_rvw2 = pd.read_sql(query2a_eda, con = engine)
print(date_rvw2)

              min_trip_dt         max_trip_dt   min_st_dt   max_st_dt
0 2019-05-01 00:00:55.423 2019-08-01 07:04:00  2019-05-01  2019-07-31  \

   min_strt         max_strt  min_end_dt  max_end_dt min_end_tm
0  00:00:00  23:59:59.506666  2019-05-01  2019-08-01   00:00:00  \

        max_end_tm
0  23:59:59.310000

#2 EDA Answer: earliest start date is 2019-05-01, latest end date is 2019-08-01, both tables appear to agree on date range

#3 EDA - - Is time represented with am/pm or using 24 hour values in each of the columns that include time?
#3 EDA Answer: 24 hour values are used in columns that include time

In [18]:
#4 EDA - - - What values are there in the sumdgroup column? Are there any that are not of interest for this project?

query4_eda=  '''
SELECT distinct(sumdgroup)
FROM scooters;
'''

result4 = engine.execute(query4_eda)

In [19]:
sumd_rvw = pd.read_sql(query4_eda, con = engine)
print(sumd_rvw)

  sumdgroup
0   bicycle
1   scooter
2   Scooter

#4 EDA Answer:

In [34]:
#5 EDA - - What are the minimum and maximum values for all the latitude and longitude columns? 
#Do these ranges make sense, or is there anything surprising?
 
query5_eda=  '''
SELECT min(latitude) as min_lat, max(latitude) as max_lat,
min(longitude) as min_lon, max(longitude) as max_lon
FROM scooters;
'''

result5 = engine.execute(query5_eda)

In [35]:
loc_rvw1 = pd.read_sql(query5_eda, con = engine)
print(loc_rvw1)

   min_lat       max_lat    min_lon  max_lon
0      0.0  3.609874e+06 -97.443879      0.0

In [36]:
query5a_eda=  '''
SELECT min(startlatitude) as min_st_lat, max(startlatitude) as max_st_lat,
    min(startlongitude) as min_st_lon, max(startlongitude) as max_st_lon,
    min(endlatitude) as min_ed_lat, max(endlatitude) as max_ed_lat,
    min(endlongitude) as min_ed_lon, max(endlongitude) as max_ed_lon,
    min(tripduration) as min_trp_dur, max(tripduration) as max_trp_dur,
    min(tripdistance) as min_trp_dis, max(tripdistance) as max_trp_dis
FROM trips;
'''

result5a = engine.execute(query5a_eda)

In [37]:
loc_rvw2 = pd.read_sql(query5a_eda, con = engine)
print(loc_rvw2)

   min_st_lat  max_st_lat  min_st_lon  max_st_lon  min_ed_lat  max_ed_lat
0     35.8532   36.300029  -86.918008    -86.3662  -36.850405   51.045409  \

   min_ed_lon  max_ed_lon  min_trp_dur  max_trp_dur  min_trp_dis   max_trp_dis
0 -122.673729  174.764886   -19.358267     512619.0  -20324803.8  3.188448e+07

In [38]:
#5 EDA - - #What is the range of values for trip duration and trip distance? Do these values make sense? Explore
##checks for tripduration (10 highest / 10 lowest)

query5b_eda=  '''
SELECT tripduration as top_10_dur
FROM trips
ORDER BY tripduration DESC
LIMIT 10;
'''

result5b = engine.execute(query5a_eda)

query5c_eda=  '''
SELECT tripduration as btm_10_dur
FROM trips
ORDER BY tripduration 
LIMIT 10;
'''

result5c = engine.execute(query5c_eda)

In [44]:
dur_rvw1 = pd.read_sql(query5b_eda, con = engine)
print(round(dur_rvw1, 2))

dur_rvw2 = pd.read_sql(query5c_eda, con = engine)
print(round(dur_rvw2, 2))

   top_10_dur
0    512619.0
1    257790.0
2     93837.0
3     92977.0
4     78802.0
5     64311.0
6     62717.0
7     62066.0
8     59482.0
9     56793.0
   btm_10_dur
0      -19.36
1      -10.98
2      -10.24
3       -8.00
4       -4.62
5       -1.36
6       -0.72
7       -0.50
8        0.00
9        0.00

#5 EDA Answer cont (tripduration): some outlier values in top_10_dur, negative values in btm_10_dur do not make sense --- may be inaccurate recording

In [55]:
#5 EDA - - #What is the range of values for trip duration and trip distance? Do these values make sense? Explore
##checks for tripdistance (10 highest / 10 lowest)

query5d_eda=  '''
SELECT tripdistance as top_10_dis
FROM trips
ORDER BY tripdistance DESC
LIMIT 10;
'''

result5d = engine.execute(query5d_eda)

query5e_eda=  '''
SELECT tripdistance as btm_10_dis
FROM trips
ORDER BY tripdistance 
LIMIT 10;
'''

result5e = engine.execute(query5e_eda)

In [56]:
dis_rvw1 = pd.read_sql(query5d_eda, con = engine)
print(round(dis_rvw1,2))

dis_rvw2 = pd.read_sql(query5e_eda, con = engine)
print(round(dis_rvw2,2))

    top_10_dis
0  31884482.65
1  18489501.90
2  18489501.90
3  18489501.90
4   7580025.94
5   6485564.51
6   4607692.28
7   4340344.20
8   4308714.01
9   4275554.96
    btm_10_dis
0 -20324803.80
1 -19900919.27
2  -9337270.64
3  -2758530.27
4  -2253937.08
5  -1685315.01
6  -1684970.53
7  -1684806.48
8  -1684701.50
9  -1119963.95

#5 EDA Answer cont (tripdistance): some outlier values in top_10_dis, negative values in btm_10_dis do not make sense --- may be inaccurate recording

In [51]:
#6 EDA - - Check out how the values for the company name column in the scooters table compare to those of the trips table. 
#What do you notice?

query6_eda=  '''
SELECT DISTINCT s.companyname as s_nm 
FROM scooters as s;
'''

result6 = engine.execute(query6_eda)

query6a_eda=  '''
SELECT DISTINCT t.companyname as t_nm 
FROM trips as t;
'''

result6a = engine.execute(query6a_eda)

In [52]:
nm_rvw_sctr = pd.read_sql(query6_eda, con = engine)
print(nm_rvw_sctr)

nm_rvw_trp = pd.read_sql(query6a_eda, con = engine)
print(nm_rvw_trp)

     s_nm
0    Bird
1    Bolt
2  Gotcha
3    Jump
4    Lime
5    Lyft
6    Spin
            t_nm
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN

In [ ]:
#6 EDA Answer: both tables have the same 7 companies. Bolt listed in scooters table / Bolt Mobility listed in trips table

#scooters project questions
Once you've gotten an understanding of what is contained in the available tables, start with addressing these questions:
1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?
2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule? 
3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?
4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region?
4. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd.

In [57]:
#1 Project - - During this period, seven companies offered scooters. 
#How many scooters did each company have in this time frame? 
#Did the number for each company change over time? 
#Did scooter usage vary by company?

query1_proj=  '''
SELECT companyname, COUNT(DISTINCT sumdid) as scooter_count
from scooters
WHERE sumdgroup ILIKE 'scooter'
GROUP BY companyname;
'''

result1_proj = engine.execute(query1_proj)

In [63]:
###How many scooters did each company have in this time frame? 

##received error originally running query: QueuePool limit of size <x> overflow <y> reached, connection timed out, timeout <z>
##adjusted engine above like: engine = create_engine("mysql://u:p@host/db", pool_size=10, max_overflow=20)
##https://docs.sqlalchemy.org/en/14/errors.html#error-3o7r)

scooter_count = pd.read_sql(query1_proj, con = engine, index_col='companyname')
scooter_count.head()

             scooter_count
companyname
Bird                  3860
Bolt                   360
Gotcha                 224
Jump                  1210
Lime                  1818

In [64]:
print(scooter_count)

             scooter_count
companyname
Bird                  3860
Bolt                   360
Gotcha                 224
Jump                  1210
Lime                  1818
Lyft                  1735
Spin                   805

In [76]:
#1 Project Continued-
#How many scooters did each company have in this time frame? 
#Did the number for each company change over time?
#Answer: View table below for count by company / month. Bird, Bolt, Lime, Lyft, & Spin numbers reduced over the 3 month period.
##query for by month count
##query runtime >13 min

query1a_proj=  '''
with CTE1 as
    (SELECT companyname, COUNT(DISTINCT sumdid) as may_sumd_count 
    FROM scooters
    WHERE pubdatetime BETWEEN '2019-05-01 00:00:00.00' AND '2019-05-31 23:59:00.00' AND sumdgroup ILIKE 'scooter'
    GROUP BY companyname),
CTE2 as
    (SELECT companyname, COUNT(DISTINCT sumdid) as jun_sumd_count  
    FROM scooters
    WHERE pubdatetime BETWEEN '2019-06-01 00:00:00.00' AND '2019-06-30 23:59:00.00' AND sumdgroup ILIKE 'scooter'
    GROUP BY companyname),
CTE3 as
    (SELECT companyname, COUNT(DISTINCT sumdid) as jul_sumd_count 
    FROM scooters
    WHERE pubdatetime BETWEEN '2019-07-01 00:00:00.00' AND '2019-07-31 23:59:00.00' AND sumdgroup ILIKE 'scooter'
    GROUP BY companyname),  
CTE4 as
    (SELECT companyname, COUNT(DISTINCT sumdid) as all_months_sumd_count 
    FROM scooters
    WHERE sumdgroup ILIKE 'scooter'
    GROUP BY companyname) 
SELECT s.companyname, CTE1.may_sumd_count, CTE2.jun_sumd_count, CTE3.jul_sumd_count, CTE4.all_months_sumd_count
FROM scooters AS s
JOIN CTE1
USING (companyname)
JOIN CTE2
USING (companyname)
JOIN CTE3
USING (companyname)
JOIN CTE4
USING (companyname)
GROUP BY companyname, CTE1.may_sumd_count, CTE2.jun_sumd_count, CTE3.jul_sumd_count, CTE4.all_months_sumd_count;
'''
scooter_count_by_month = pd.read_sql(query1a_proj, con = engine, index_col='companyname')
scooter_count_by_month

,may_sumd_count,jun_sumd_count,jul_sumd_count,all_months_sumd_count
companyname,,,,
Lime,1631,1455,902,1818
Lyft,1376,1152,1026,1735
Jump,976,1036,1206,1210
Spin,687,713,570,805
Bird,3064,2910,2583,3860
Bolt,346,333,276,360
Gotcha,223,223,224,224

In [72]:
##cleaner and more eloquent version of code above from instructor 
##query returns same values as above but runs faster w/ less code
## ~4+ min for query to run
query1a_refined = '''
SELECT companyname, EXTRACT(MONTH from pubdatetime) :: INT AS month_num, COUNT(DISTINCT sumdid)
FROM scooters
GROUP BY companyname, month_num
'''
refined_count_by_month = pd.read_sql(query1a_refined, con=engine)

In [73]:
refined_count_by_month

   companyname  month_num  count
0         Bird          5   3064
1         Bird          6   2910
2         Bird          7   2583
3         Bolt          5    346
4         Bolt          6    333
5         Bolt          7    276
6       Gotcha          5    223
7       Gotcha          6    223
8       Gotcha          7    224
9         Jump          5    976
10        Jump          6   1036
11        Jump          7   1206
12        Lime          5   1632
13        Lime          6   1461
14        Lime          7    903
15        Lyft          5   1376
16        Lyft          6   1152
17        Lyft          7   1026
18        Spin          5    687
19        Spin          6    713
20        Spin          7    570

In [68]:
#1 Project Continued-
#Did scooter usage vary by company?
#Answer: Trips recorded by each company varied. Highest Trip count from Lime '50656' / Lowest Trip count from Gotcha '187'

query1b_proj=  '''
SELECT
    companyname,
    COUNT(DISTINCT triprecordnum) AS trip_rcrds_by_co
FROM trips
GROUP BY companyname;
'''

result1b_proj = engine.execute(query1b_proj)

In [69]:
trip_records_by_co = pd.read_sql(query1b_proj, con = engine, index_col='companyname')
print(trip_records_by_co)

               trip_rcrds_by_co
companyname
Bird                      10868
Bolt Mobility              1232
Gotcha                      187
JUMP                        850
Lime                      50656
Lyft                       3582
SPIN                       1597

#2 Project -- According to Second Substitute Bill BL2018-1202 (as amended), all permitted operators will first clean data before providing or reporting data to Metro. 
#Data processing and cleaning shall include:  
    #* Removal of staff servicing and test trips  
    #* Removal of trips below one minute  
    #* Trip lengths are capped at 24 hours  
#Are the scooter companies in compliance with the second and third part of this rule?

In [ ]:
##2 Project
    #* Removal of staff servicing and test trips  
#How to determine removal of trips for staff servicing / test trips??? 
#(There does not seem to be any specific data that can definitively provide this info...Discuss w/ Group)

In [75]:
##2 Project 
    #* Removal of trips below one minute  
    #* Trip lengths are capped at 24 hours
#Answer: Query below inidcates that Bird, Lyme, and Lyft are not in compliance with cleaning trip data < 1min 
#Bolt, Spin, and Lyft are not in complinance with cleaning trip data > 24hr.

query2_proj=  '''
with CTE1 AS
    (SELECT companyname,
    COUNT(tripduration) AS trips_undr_1min
    FROM trips
    WHERE tripduration < 1 
    GROUP BY companyname),
CTE2 as 
    (SELECT companyname,
    COUNT(tripduration) AS  trips_over_24hr
    FROM trips
    WHERE tripduration > 1440
    GROUP BY companyname) 
SELECT companyname, COALESCE(CTE1.trips_undr_1min, 0) AS trips_undr_1min, COALESCE(CTE2.trips_over_24hr, 0) AS  trips_over_24hr
FROM trips
LEFT JOIN CTE1
USING (companyname)
LEFT JOIN CTE2
USING (companyname)
GROUP BY companyname, CTE1.trips_undr_1min, CTE2.trips_over_24hr;
'''

trip_dur_compliance = pd.read_sql(query2_proj, con = engine)
print(trip_dur_compliance)

     companyname  trips_undr_1min  trips_over_24hr
0  Bolt Mobility                0             6908
1           JUMP                0                0
2           Lime              661                0
3         Gotcha                0                0
4           Bird             3963                0
5           SPIN                0               28
6           Lyft             4530                2

In [ ]:
##3 Project -- The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. 
##Based on the data, what is the average number of trips per scooter per day? 
##Make sure to consider the days that a scooter was available. How does this vary by company?